# Режим	Обозначение
# 'r'	открытие на чтение (является значением по умолчанию).
# 'w'	открытие на запись, содержимое файла удаляется, если файла не существует, создается новый.
# 'x'	открытие на запись, если файла не существует, иначе исключение.
# 'a'	открытие на дозапись, информация добавляется в конец файла.
# 'b'	открытие в двоичном режиме.
# 't'	открытие в текстовом режиме (является значением по умолчанию).
# '+'	открытие на чтение и запись

inputString = input()

f = open('text4.txt', 'r')

for line in f:
    parsedLine = line.split(' ')
    if inputString == parsedLine[0]+' '+parsedLine[1]+' '+parsedLine[2]:
        print(parsedLine[3])
